Revit 2027 API
CategorySet.Erase Method
Removes a specified category from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Category item
)
Public Overridable Function Erase (
	item As Category
) As Integer
public:
virtual int Erase(
	Category^ item
)
abstract Erase :
        item : Category -> int
override Erase :
        item : Category -> int
Parameters
item Category
The category to be erased.
Return Value
Int32
The number of items that were erased from the set.
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace